Port Securety
Prot Securety چیست؟جلو گیری از دستگاه های غیر قابل مجاز به شبکه خود را مدیریت کنیم و جلوی آن را بگیریم
Mac Flooding Attack
Mac Address Spoofing
DHCP Starvation
حالت های قابل استفاده:
Protect ترافیک غیر مجاز Drop می شود و لاگ تولید نمی کند
Restrict ترافیک غیر مجاز drop می شود و لاگ تولید می کند
Shutdown حالت پیش فرض هست 
نکته:اوین قدم برای راه اندازی این سرویس باید بر روی پورت های خود به حالت access باشد 
نکته:وقتی شما پورت مورد نظر خود را به حالت sticky قرار می دهید سوئیچ اولین مک آدرسی که به آن می رسد را بر می دارد و آن را مجاز قرار می دهد 
SW(config-if)#switchport port-security mac-address stickyبرای مشخص کردن نوع اکشن های که می خواهیم Protect ,Restrict , Shutdown :
SW(config-if)#switchport port-security violation shutdown
می توانید تعداد مک های مجاز و غیر مجاز را بر روی پورت های خود با maximum مشخص کنید:
SW(config-if)#switchport port-security maximum 2 
پیش فرض 1 هست که شما می توانید مقدار آن را تغییر دهید 
دستورات:
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport port-security ?
  aging        Port-security aging commands
  mac-address  Secure mac address
  maximum      Max secure addresses
  violation    Security violation mode
  <cr>
نکته:برای اینکه شما مک ادرس خود را درون سوئیچ های سیسکو قرار دهید باید به حالت زیر اینکار را کنید :
AAAA.BBBB.CCCC.DDDD 4 تای از هم جدا کرده و دات بین آن می زنیم:
Switch(config-if)#switchport port-security mac-address 0030.F2E6.AAA7
Port-security not enabled on interface FastEthernet0/1.
Switch(config-if)#switchport port-security
Switch#show running-config 
Building configuration...

Current configuration : 1183 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport mode access
 switchport port-security
 switchport port-security mac-address 0030.F2E6.AAA7
!
اگر دستور شو راننیگ کانفیگ را گرفتید و برای شما پورت های سکورتی شده با مک را نشن نداد دوباره اینکار را کنید 
دستوراتی که برای دیدن پورت سکورتی استفاده می شود:
Switch#show port-security 
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
               (Count)       (Count)        (Count)
--------------------------------------------------------------------
        Fa0/1        1          1                 0         Shutdown
----------------------------------------------------------------------
نکته:در دنیای واقعی وقتی شما یک سیستم دیگر را به شبکه متصل می نمائید به محض اینکه متصل شود آن پورت خاموش می شود اما در برنامه این گونه نیست و شما اول باید یک بسته اطلاعاتی ارسال کنید بعد پورت خاموش می شود وقتی این کار را می کنید این اتفاقات نمایش داده می شود:
Switch#show port-security 
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
               (Count)       (Count)        (Count)
--------------------------------------------------------------------
        Fa0/1        1          1                 1         Shutdown
----------------------------------------------------------------------
برای اینکه این مشکل حل شود خیلی ساده بر روی پورت مورد نظر رفته و آن را یک بار خاموش و روشن نماید
Switch#show interfaces fastEthernet 0/1 
FastEthernet0/1 is down, line protocol is down (err-disabled)
  Hardware is Lance, address is 00d0.9761.2601 (bia 00d0.9761.2601)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s
  input flow-control is off, output flow-control is off
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     956 packets input, 193351 bytes, 0 no buffer
     Received 956 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     2357 packets output, 263570 bytes, 0 underruns
Switch#show interfaces fastEthernet 0/1 
FastEthernet0/1 is down, line protocol is down (err-disabled)
  Hardware is Lance, address is 00d0.9761.2601 (bia 00d0.9761.2601)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s
  input flow-control is off, output flow-control is off
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     956 packets input, 193351 bytes, 0 no buffer
     Received 956 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     2357 packets output, 263570 bytes, 0 underruns

Switch(config-if)#shutdown 
Switch(config-if)#no shutdown

Switch#show interfaces fastEthernet 0/1
FastEthernet0/1 is up, line protocol is up (connected)
  Hardware is Lance, address is 00d0.9761.2601 (bia 00d0.9761.2601)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s
  input flow-control is off, output flow-control is off
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     956 packets input, 193351 bytes, 0 no buffer
     Received 956 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     2357 packets output, 263570 bytes, 0 underruns
نکته:دستوری دیگر هست برای اینکه شما پورت های خود را ببینید برای پورت سکورتی ها:
Switch#show port-security address 
               Secure Mac Address Table
-----------------------------------------------------------------------------
Vlan    Mac Address       Type                          Ports   Remaining Age
                                                                   (mins)
----    -----------       ----                          -----   -------------
   1    0030.F2E6.AAA7    SecureConfigured              Fa0/1        -
-----------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 0
Max Addresses limit in System (excluding one mac per port) : 1024
توجه داشته باشد وقتی که پورت سکورتی های خود را قرار می دهید حتما حتما سوئیچ خد را ذخیره نماید
برای پاک کردن ستیکی های که دریافت کرده اید کد زیر:
Switch#clear port-security sticky 
برای پاک کردن همه مک آدرس های خود هم دستور زیر:
Switch#clear port-security all


کل دستورات:
SW(config)#interface fastethernet 0/1
SW(config-if)#switchport mode access
SW(config-if)#switchport port-security mac-address 1111.bbbb.2222
SW(config-if)#switchport port-security mac-address sticky
SW(config-if)#switchport port-security violation portect
SW(config-if)#switchport port-security maximum 1
SW(config-if)#switchport port-security
SW#show port-security
SW#show port-security address
SW#show interface fastethernet 0/1
SW#clear port-security all
SW#clear port-security sticky interface fastEthernet 0/1